Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementObjectsTimes
Analysis change management times.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementObjectsTimes.Operation
The operation.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementObjectsTimes.AnalysisModelName
The name of the analysis model.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementObjectsTimes.ObjectId
Object identifier.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementObjectsTimes.TimeId
Time identifier.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementObjectsTimes.ComparisonTimeId
Comparison time identifier.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementObjectsTimes.StartIndex
Start item index.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementObjectsTimes.ObjectIds
Object identifiers.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementObjectsTimes.ObjectTypes
Object types.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementObjectsTimes.Times
Times.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementObjectsTimes.ItemCount
Item count.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementObjectsTimes.TotalCount
Total item count.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementObjectsTimes.NextBlock
Set for next block of data.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementObjectsTimes.MoreItems
Check if there is more data.
Returns: True if there is more data.